export const items = [
  "ضوء تنبيه المحرك",
  "ملاحظات المركبة",
  "الفرامل",
  "مانع الانزلاق",
  "تنبيه الفرامل اليدوية",
  "تنبية الفرامل اليدوية",
  "الفرامل",
  "مانع الانزلاق",
];

export const customerNotes = [
  "حرارة عند الوقوف",
  "الإشارة في المراية اليمين لا تعمل",
  "صوت طقطقة أسفل المركبة",
  "تأخر بالتشغيل",
  "التكييف لا يبرد عند الوقوف التام",
  "حرارة عند الوقوف",
  "صوت عند الضغط على الفرامل من الأمام",
];

export const technicianNotes = [
  "يجب الإنتهاء من المركبة خلال يومين كحد أقصى",
  "قطع غيار اصلية فقط",
  "يوجد مشكلة تهريب بالكهرباء من المسجل",
  "البطارية بحاجة الى شحن أو استبدال",
  "تشييك الليكات في دورة التكييف",
  "التأكد من عدم وجود تهريب في دورة المياه",
  "تشييك الفرامل إن كانت بحاجة الى استبدال من عدمه",
  "فحص كمبيوتر",
  "الدرامات رقيقة لا تصلح للخراطة يجب استبدالها بعد إبلاغ العميل",
  "تشييك الظفيرة في حال وجود شورت كهرباء",
];

export const servicesItems = [
  "تبديل سفايف أمامية",
  "مخرطة دسكـات عدد 4",
  "تبديل بوشات",
  "تبديل راديتر",
  "تبديل لينك رود",
  "تبديل كت بوش",
  "تبديل لمبة إشارة مراية يمين",
  "تنظيف انجكترات",
  "تبديل إكسل بوت يمين",
  "تبديل لمبة إشارة مراية يمين",
  "تبديل لمبة إشارة مراية يمين",
  "تبديل سفايف أمامية",
  "مخرطة دسكـات عدد 4",
  "تبديل بوشات",
  "تبديل راديتر",
  "تبديل لينك رود",
  "تبديل كت بوش",
];

export const sparePartsList = [
  { qty: "1", desc: "سفايف أمامية" },
  { qty: "2", desc: "رود لينك" },
  { qty: "1", desc: "لمبة إشارة" },
  { qty: "1", desc: "سفايف أمامية" },
  { qty: "2", desc: "رود لينك" },
  { qty: "1", desc: "لمبة إشارة" },
  { qty: "1", desc: "فلتر زيت محرك" },
  { qty: "1", desc: "راديتر مستعمل أصلي" },
  { qty: "2", desc: "جمبينات خلفية KYP" },
  { qty: "1", desc: "زيت ماكينة كاسترول 5W30" },
  { qty: "1", desc: "راديتر مستعمل أصلي" },
  { qty: "2", desc: "جمبينات خلفية KYP" },
  { qty: "1", desc: "كت بوش هيفي ديوتي" },
  { qty: "1", desc: "أكسل بوت يمين" },
  { qty: "1", desc: "مياه راديتر مانول أزرق" },
  { qty: "1", desc: "أكسل بوت يمين" },
  { qty: "1", desc: "أكسل بوت يمين" },
  { qty: "", desc: "" },
];

export const termsAndConditions = [
  "لا يتم استلام السيارة إلا بعد دفع جميع المستحقات الخاصة بالعقد.",
  "يحق للمؤجر إيقاف المركبة أو سحبها في أي وقت دون الرجوع إلى المستأجر في حال تأخره عن سداد مستحقات العقد دون تحمله أي مسؤولية عن أي متعلقات للمستأجر داخل المركبة.",
  "يتعلم المستأجر في عدم عدم إلتزامه بدفع مبلغ 5000 درهم بالإضافة إلى أتعاب المحاماة.",
  "المستأجر مسؤول عن رسوم التأمين الزائدة البالغة 1500-2000 درهماً + 20% من تكلفة الإصلاح إذا كان عمره أقل من 25 عاماً أو عمر رخصة القيادة أقل من عام واحد.",
  "لا يتم إعادة الضمان إلا بعد مرور 10 أيام عمل للتأكد من عدم وجود أي مخالفات مرورية وما شابه.",
  "تسري كافة القوانين واللوائح والأنظمة والمعمول بها في الدولة على طرفي الإتفاقية سواء ورد أم لم يرد في هذه الإتفاقية بما لا يتعارض مع أحكامها.",
];

const totalColumns = 3;
const itemsPerColumn = Math.ceil(sparePartsList.length / totalColumns);

// 2. Map indices into 3 structural data chunks
export  const columnsData = Array.from({ length: totalColumns }, (_, colIndex) => {
  const start = colIndex * itemsPerColumn;
  const end = start + itemsPerColumn;
  return sparePartsList.slice(start, end);
});